{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "level1_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 320, 240, 4], "dtype": "float32", "sparse": false, "name": "level1_input"}, "inbound_nodes": []}, {"name": "level1_conv_1_convLayer", "class_name": "Conv2D", "config": {"name": "level1_conv_1_convLayer", "trainable": true, "filters": 64, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["level1_input", 0, 0, {}]]]}, {"name": "level1_conv_1_bnScale", "class_name": "BatchNormalization", "config": {"name": "level1_conv_1_bnScale", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["level1_conv_1_convLayer", 0, 0, {}]]]}, {"name": "level1_mp", "class_name": "MaxPooling2D", "config": {"name": "level1_mp", "trainable": true, "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["level1_conv_1_bnScale", 0, 0, {}]]]}, {"name": "level2_res2a_conv_1_convLayer", "class_name": "Conv2D", "config": {"name": "level2_res2a_conv_1_convLayer", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["level1_mp", 0, 0, {}]]]}, {"name": "level2_res2a_conv_1_bnScale", "class_name": "BatchNormalization", "config": {"name": "level2_res2a_conv_1_bnScale", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["level2_res2a_conv_1_convLayer", 0, 0, {}]]]}, {"name": "level2_res2a_relu1", "class_name": "Activation", "config": {"name": "level2_res2a_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["level2_res2a_conv_1_bnScale", 0, 0, {}]]]}, {"name": "level2_res2a_conv_2_convLayer", "class_name": "Conv2D", "config": {"name": "level2_res2a_conv_2_convLayer", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["level2_res2a_relu1", 0, 0, {}]]]}, {"name": "level2_res2a_conv_2_bnScale", "class_name": "BatchNormalization", "config": {"name": "level2_res2a_conv_2_bnScale", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["level2_res2a_conv_2_convLayer", 0, 0, {}]]]}, {"name": "level2_res2a_relu2", "class_name": "Activation", "config": {"name": "level2_res2a_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["level2_res2a_conv_2_bnScale", 0, 0, {}]]]}, {"name": "level2_res2a_conv_4_convLayer", "class_name": "Conv2D", "config": {"name": "level2_res2a_conv_4_convLayer", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["level1_mp", 0, 0, {}]]]}, {"name": "level2_res2a_conv_3_convLayer", "class_name": "Conv2D", "config": {"name": "level2_res2a_conv_3_convLayer", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["level2_res2a_relu2", 0, 0, {}]]]}, {"name": "level2_res2a_conv_4_bnScale", "class_name": "BatchNormalization", "config": {"name": "level2_res2a_conv_4_bnScale", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["level2_res2a_conv_4_convLayer", 0, 0, {}]]]}, {"name": "level2_res2a_conv_3_bnScale", "class_name": "BatchNormalization", "config": {"name": "level2_res2a_conv_3_bnScale", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["level2_res2a_conv_3_convLayer", 0, 0, {}]]]}, {"name": "level2_res2a_add", "class_name": "Add", "config": {"name": "level2_res2a_add", "trainable": true}, "inbound_nodes": [[["level2_res2a_conv_4_bnScale", 0, 0, {}], ["level2_res2a_conv_3_bnScale", 0, 0, {}]]]}, {"name": "level2_res2a_relu3", "class_name": "Activation", "config": {"name": "level2_res2a_relu3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["level2_res2a_add", 0, 0, {}]]]}, {"name": "level2_res2b_conv_1_convLayer", "class_name": "Conv2D", "config": {"name": "level2_res2b_conv_1_convLayer", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["level2_res2a_relu3", 0, 0, {}]]]}, {"name": "level2_res2b_conv_1_bnScale", "class_name": "BatchNormalization", "config": {"name": "level2_res2b_conv_1_bnScale", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["level2_res2b_conv_1_convLayer", 0, 0, {}]]]}, {"name": "level2_res2b_relu1", "class_name": "Activation", "config": {"name": "level2_res2b_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["level2_res2b_conv_1_bnScale", 0, 0, {}]]]}, {"name": "level2_res2b_conv_2_convLayer", "class_name": "Conv2D", "config": {"name": "level2_res2b_conv_2_convLayer", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["level2_res2b_relu1", 0, 0, {}]]]}, {"name": "level2_res2b_conv_2_bnScale", "class_name": "BatchNormalization", "config": {"name": "level2_res2b_conv_2_bnScale", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["level2_res2b_conv_2_convLayer", 0, 0, {}]]]}, {"name": "level2_res2b_relu2", "class_name": "Activation", "config": {"name": "level2_res2b_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["level2_res2b_conv_2_bnScale", 0, 0, {}]]]}, {"name": "level2_res2b_conv_3_convLayer", "class_name": "Conv2D", "config": {"name": "level2_res2b_conv_3_convLayer", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["level2_res2b_relu2", 0, 0, {}]]]}, {"name": "level2_res2b_conv_3_bnScale", "class_name": "BatchNormalization", "config": {"name": "level2_res2b_conv_3_bnScale", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["level2_res2b_conv_3_convLayer", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["level2_res2a_relu3", 0, 0, {}], ["level2_res2b_conv_3_bnScale", 0, 0, {}]]]}, {"name": "level2_res2b_relu3", "class_name": "Activation", "config": {"name": "level2_res2b_relu3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "level2_res2c_conv_1_convLayer", "class_name": "Conv2D", "config": {"name": "level2_res2c_conv_1_convLayer", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["level2_res2b_relu3", 0, 0, {}]]]}, {"name": "level2_res2c_conv_1_bnScale", "class_name": "BatchNormalization", "config": {"name": "level2_res2c_conv_1_bnScale", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["level2_res2c_conv_1_convLayer", 0, 0, {}]]]}, {"name": "level2_res2c_relu1", "class_name": "Activation", "config": {"name": "level2_res2c_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["level2_res2c_conv_1_bnScale", 0, 0, {}]]]}, {"name": "level2_res2c_conv_2_convLayer", "class_name": "Conv2D", "config": {"name": "level2_res2c_conv_2_convLayer", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["level2_res2c_relu1", 0, 0, {}]]]}, {"name": "level2_res2c_conv_2_bnScale", "class_name": "BatchNormalization", "config": {"name": "level2_res2c_conv_2_bnScale", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["level2_res2c_conv_2_convLayer", 0, 0, {}]]]}, {"name": "level2_res2c_relu2", "class_name": "Activation", "config": {"name": "level2_res2c_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["level2_res2c_conv_2_bnScale", 0, 0, {}]]]}, {"name": "level2_res2c_conv_3_convLayer", "class_name": "Conv2D", "config": {"name": "level2_res2c_conv_3_convLayer", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["level2_res2c_relu2", 0, 0, {}]]]}, {"name": "level2_res2c_conv_3_bnScale", "class_name": "BatchNormalization", "config": {"name": "level2_res2c_conv_3_bnScale", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["level2_res2c_conv_3_convLayer", 0, 0, {}]]]}, {"name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true}, "inbound_nodes": [[["level2_res2b_relu3", 0, 0, {}], ["level2_res2c_conv_3_bnScale", 0, 0, {}]]]}, {"name": "level2_res2c_relu3", "class_name": "Activation", "config": {"name": "level2_res2c_relu3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "level3_res3a_conv_1_convLayer", "class_name": "Conv2D", "config": {"name": "level3_res3a_conv_1_convLayer", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["level2_res2c_relu3", 0, 0, {}]]]}, {"name": "level3_res3a_conv_1_bnScale", "class_name": "BatchNormalization", "config": {"name": "level3_res3a_conv_1_bnScale", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["level3_res3a_conv_1_convLayer", 0, 0, {}]]]}, {"name": "level3_res3a_relu1", "class_name": "Activation", "config": {"name": "level3_res3a_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["level3_res3a_conv_1_bnScale", 0, 0, {}]]]}, {"name": "level3_res3a_conv_2_convLayer", "class_name": "Conv2D", "config": {"name": "level3_res3a_conv_2_convLayer", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["level3_res3a_relu1", 0, 0, {}]]]}, {"name": "level3_res3a_conv_2_bnScale", "class_name": "BatchNormalization", "config": {"name": "level3_res3a_conv_2_bnScale", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["level3_res3a_conv_2_convLayer", 0, 0, {}]]]}, {"name": "level3_res3a_relu2", "class_name": "Activation", "config": {"name": "level3_res3a_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["level3_res3a_conv_2_bnScale", 0, 0, {}]]]}, {"name": "level3_res3a_conv_4_convLayer", "class_name": "Conv2D", "config": {"name": "level3_res3a_conv_4_convLayer", "trainable": true, "filters": 512, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["level2_res2c_relu3", 0, 0, {}]]]}, {"name": "level3_res3a_conv_3_convLayer", "class_name": "Conv2D", "config": {"name": "level3_res3a_conv_3_convLayer", "trainable": true, "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["level3_res3a_relu2", 0, 0, {}]]]}, {"name": "level3_res3a_conv_4_bnScale", "class_name": "BatchNormalization", "config": {"name": "level3_res3a_conv_4_bnScale", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["level3_res3a_conv_4_convLayer", 0, 0, {}]]]}, {"name": "level3_res3a_conv_3_bnScale", "class_name": "BatchNormalization", "config": {"name": "level3_res3a_conv_3_bnScale", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["level3_res3a_conv_3_convLayer", 0, 0, {}]]]}, {"name": "level3_res3a_add", "class_name": "Add", "config": {"name": "level3_res3a_add", "trainable": true}, "inbound_nodes": [[["level3_res3a_conv_4_bnScale", 0, 0, {}], ["level3_res3a_conv_3_bnScale", 0, 0, {}]]]}, {"name": "level3_res3a_relu3", "class_name": "Activation", "config": {"name": "level3_res3a_relu3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["level3_res3a_add", 0, 0, {}]]]}, {"name": "level3_res3b_conv_1_convLayer", "class_name": "Conv2D", "config": {"name": "level3_res3b_conv_1_convLayer", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["level3_res3a_relu3", 0, 0, {}]]]}, {"name": "level3_res3b_conv_1_bnScale", "class_name": "BatchNormalization", "config": {"name": "level3_res3b_conv_1_bnScale", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["level3_res3b_conv_1_convLayer", 0, 0, {}]]]}, {"name": "level3_res3b_relu1", "class_name": "Activation", "config": {"name": "level3_res3b_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["level3_res3b_conv_1_bnScale", 0, 0, {}]]]}, {"name": "level3_res3b_conv_2_convLayer", "class_name": "Conv2D", "config": {"name": "level3_res3b_conv_2_convLayer", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["level3_res3b_relu1", 0, 0, {}]]]}, {"name": "level3_res3b_conv_2_bnScale", "class_name": "BatchNormalization", "config": {"name": "level3_res3b_conv_2_bnScale", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["level3_res3b_conv_2_convLayer", 0, 0, {}]]]}, {"name": "level3_res3b_relu2", "class_name": "Activation", "config": {"name": "level3_res3b_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["level3_res3b_conv_2_bnScale", 0, 0, {}]]]}, {"name": "level3_res3b_conv_3_convLayer", "class_name": "Conv2D", "config": {"name": "level3_res3b_conv_3_convLayer", "trainable": true, "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["level3_res3b_relu2", 0, 0, {}]]]}, {"name": "level3_res3b_conv_3_bnScale", "class_name": "BatchNormalization", "config": {"name": "level3_res3b_conv_3_bnScale", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["level3_res3b_conv_3_convLayer", 0, 0, {}]]]}, {"name": "add_3", "class_name": "Add", "config": {"name": "add_3", "trainable": true}, "inbound_nodes": [[["level3_res3a_relu3", 0, 0, {}], ["level3_res3b_conv_3_bnScale", 0, 0, {}]]]}, {"name": "level3_res3b_relu3", "class_name": "Activation", "config": {"name": "level3_res3b_relu3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"name": "level3_res3c_conv_1_convLayer", "class_name": "Conv2D", "config": {"name": "level3_res3c_conv_1_convLayer", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["level3_res3b_relu3", 0, 0, {}]]]}, {"name": "level3_res3c_conv_1_bnScale", "class_name": "BatchNormalization", "config": {"name": "level3_res3c_conv_1_bnScale", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["level3_res3c_conv_1_convLayer", 0, 0, {}]]]}, {"name": "level3_res3c_relu1", "class_name": "Activation", "config": {"name": "level3_res3c_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["level3_res3c_conv_1_bnScale", 0, 0, {}]]]}, {"name": "level3_res3c_conv_2_convLayer", "class_name": "Conv2D", "config": {"name": "level3_res3c_conv_2_convLayer", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["level3_res3c_relu1", 0, 0, {}]]]}, {"name": "level3_res3c_conv_2_bnScale", "class_name": "BatchNormalization", "config": {"name": "level3_res3c_conv_2_bnScale", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["level3_res3c_conv_2_convLayer", 0, 0, {}]]]}, {"name": "level3_res3c_relu2", "class_name": "Activation", "config": {"name": "level3_res3c_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["level3_res3c_conv_2_bnScale", 0, 0, {}]]]}, {"name": "level3_res3c_conv_3_convLayer", "class_name": "Conv2D", "config": {"name": "level3_res3c_conv_3_convLayer", "trainable": true, "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["level3_res3c_relu2", 0, 0, {}]]]}, {"name": "level3_res3c_conv_3_bnScale", "class_name": "BatchNormalization", "config": {"name": "level3_res3c_conv_3_bnScale", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["level3_res3c_conv_3_convLayer", 0, 0, {}]]]}, {"name": "add_4", "class_name": "Add", "config": {"name": "add_4", "trainable": true}, "inbound_nodes": [[["level3_res3b_relu3", 0, 0, {}], ["level3_res3c_conv_3_bnScale", 0, 0, {}]]]}, {"name": "level3_res3c_relu3", "class_name": "Activation", "config": {"name": "level3_res3c_relu3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"name": "level4_res4a_conv_1_convLayer", "class_name": "Conv2D", "config": {"name": "level4_res4a_conv_1_convLayer", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["level3_res3c_relu3", 0, 0, {}]]]}, {"name": "level4_res4a_conv_1_bnScale", "class_name": "BatchNormalization", "config": {"name": "level4_res4a_conv_1_bnScale", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["level4_res4a_conv_1_convLayer", 0, 0, {}]]]}, {"name": "level4_res4a_relu1", "class_name": "Activation", "config": {"name": "level4_res4a_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["level4_res4a_conv_1_bnScale", 0, 0, {}]]]}, {"name": "level4_res4a_conv_2_convLayer", "class_name": "Conv2D", "config": {"name": "level4_res4a_conv_2_convLayer", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["level4_res4a_relu1", 0, 0, {}]]]}, {"name": "level4_res4a_conv_2_bnScale", "class_name": "BatchNormalization", "config": {"name": "level4_res4a_conv_2_bnScale", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["level4_res4a_conv_2_convLayer", 0, 0, {}]]]}, {"name": "level4_res4a_relu2", "class_name": "Activation", "config": {"name": "level4_res4a_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["level4_res4a_conv_2_bnScale", 0, 0, {}]]]}, {"name": "level4_res4a_conv_4_convLayer", "class_name": "Conv2D", "config": {"name": "level4_res4a_conv_4_convLayer", "trainable": true, "filters": 1024, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["level3_res3c_relu3", 0, 0, {}]]]}, {"name": "level4_res4a_conv_3_convLayer", "class_name": "Conv2D", "config": {"name": "level4_res4a_conv_3_convLayer", "trainable": true, "filters": 1024, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["level4_res4a_relu2", 0, 0, {}]]]}, {"name": "level4_res4a_conv_4_bnScale", "class_name": "BatchNormalization", "config": {"name": "level4_res4a_conv_4_bnScale", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["level4_res4a_conv_4_convLayer", 0, 0, {}]]]}, {"name": "level4_res4a_conv_3_bnScale", "class_name": "BatchNormalization", "config": {"name": "level4_res4a_conv_3_bnScale", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["level4_res4a_conv_3_convLayer", 0, 0, {}]]]}, {"name": "level4_res4a_add", "class_name": "Add", "config": {"name": "level4_res4a_add", "trainable": true}, "inbound_nodes": [[["level4_res4a_conv_4_bnScale", 0, 0, {}], ["level4_res4a_conv_3_bnScale", 0, 0, {}]]]}, {"name": "level4_res4a_relu3", "class_name": "Activation", "config": {"name": "level4_res4a_relu3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["level4_res4a_add", 0, 0, {}]]]}, {"name": "level4_res4b_conv_1_convLayer", "class_name": "Conv2D", "config": {"name": "level4_res4b_conv_1_convLayer", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["level4_res4a_relu3", 0, 0, {}]]]}, {"name": "level4_res4b_conv_1_bnScale", "class_name": "BatchNormalization", "config": {"name": "level4_res4b_conv_1_bnScale", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["level4_res4b_conv_1_convLayer", 0, 0, {}]]]}, {"name": "level4_res4b_relu1", "class_name": "Activation", "config": {"name": "level4_res4b_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["level4_res4b_conv_1_bnScale", 0, 0, {}]]]}, {"name": "level4_res4b_conv_2_convLayer", "class_name": "Conv2D", "config": {"name": "level4_res4b_conv_2_convLayer", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["level4_res4b_relu1", 0, 0, {}]]]}, {"name": "level4_res4b_conv_2_bnScale", "class_name": "BatchNormalization", "config": {"name": "level4_res4b_conv_2_bnScale", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["level4_res4b_conv_2_convLayer", 0, 0, {}]]]}, {"name": "level4_res4b_relu2", "class_name": "Activation", "config": {"name": "level4_res4b_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["level4_res4b_conv_2_bnScale", 0, 0, {}]]]}, {"name": "level4_res4b_conv_3_convLayer", "class_name": "Conv2D", "config": {"name": "level4_res4b_conv_3_convLayer", "trainable": true, "filters": 1024, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["level4_res4b_relu2", 0, 0, {}]]]}, {"name": "level4_res4b_conv_3_bnScale", "class_name": "BatchNormalization", "config": {"name": "level4_res4b_conv_3_bnScale", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["level4_res4b_conv_3_convLayer", 0, 0, {}]]]}, {"name": "add_5", "class_name": "Add", "config": {"name": "add_5", "trainable": true}, "inbound_nodes": [[["level4_res4a_relu3", 0, 0, {}], ["level4_res4b_conv_3_bnScale", 0, 0, {}]]]}, {"name": "level4_res4b_relu3", "class_name": "Activation", "config": {"name": "level4_res4b_relu3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"name": "level4_res4c_conv_1_convLayer", "class_name": "Conv2D", "config": {"name": "level4_res4c_conv_1_convLayer", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["level4_res4b_relu3", 0, 0, {}]]]}, {"name": "level4_res4c_conv_1_bnScale", "class_name": "BatchNormalization", "config": {"name": "level4_res4c_conv_1_bnScale", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["level4_res4c_conv_1_convLayer", 0, 0, {}]]]}, {"name": "level4_res4c_relu1", "class_name": "Activation", "config": {"name": "level4_res4c_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["level4_res4c_conv_1_bnScale", 0, 0, {}]]]}, {"name": "level4_res4c_conv_2_convLayer", "class_name": "Conv2D", "config": {"name": "level4_res4c_conv_2_convLayer", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["level4_res4c_relu1", 0, 0, {}]]]}, {"name": "level4_res4c_conv_2_bnScale", "class_name": "BatchNormalization", "config": {"name": "level4_res4c_conv_2_bnScale", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["level4_res4c_conv_2_convLayer", 0, 0, {}]]]}, {"name": "level4_res4c_relu2", "class_name": "Activation", "config": {"name": "level4_res4c_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["level4_res4c_conv_2_bnScale", 0, 0, {}]]]}, {"name": "level4_res4c_conv_3_convLayer", "class_name": "Conv2D", "config": {"name": "level4_res4c_conv_3_convLayer", "trainable": true, "filters": 1024, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["level4_res4c_relu2", 0, 0, {}]]]}, {"name": "level4_res4c_conv_3_bnScale", "class_name": "BatchNormalization", "config": {"name": "level4_res4c_conv_3_bnScale", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["level4_res4c_conv_3_convLayer", 0, 0, {}]]]}, {"name": "add_6", "class_name": "Add", "config": {"name": "add_6", "trainable": true}, "inbound_nodes": [[["level4_res4b_relu3", 0, 0, {}], ["level4_res4c_conv_3_bnScale", 0, 0, {}]]]}, {"name": "level4_res4c_relu3", "class_name": "Activation", "config": {"name": "level4_res4c_relu3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"name": "level4_res4d_conv_1_convLayer", "class_name": "Conv2D", "config": {"name": "level4_res4d_conv_1_convLayer", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": 