__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
level1_input (InputLayer)       (None, 320, 240, 4)  0                                            
__________________________________________________________________________________________________
level1_conv_1_convLayer (Conv2D (None, 320, 240, 64) 12608       level1_input[0][0]               
__________________________________________________________________________________________________
level1_conv_1_bnScale (BatchNor (None, 320, 240, 64) 256         level1_conv_1_convLayer[0][0]    
__________________________________________________________________________________________________
level1_mp (MaxPooling2D)        (None, 160, 120, 64) 0           level1_conv_1_bnScale[0][0]      
__________________________________________________________________________________________________
level2_res2a_conv_1_convLayer ( (None, 160, 120, 64) 4160        level1_mp[0][0]                  
__________________________________________________________________________________________________
level2_res2a_conv_1_bnScale (Ba (None, 160, 120, 64) 256         level2_res2a_conv_1_convLayer[0][
__________________________________________________________________________________________________
level2_res2a_relu1 (Activation) (None, 160, 120, 64) 0           level2_res2a_conv_1_bnScale[0][0]
__________________________________________________________________________________________________
level2_res2a_conv_2_convLayer ( (None, 160, 120, 64) 36928       level2_res2a_relu1[0][0]         
__________________________________________________________________________________________________
level2_res2a_conv_2_bnScale (Ba (None, 160, 120, 64) 256         level2_res2a_conv_2_convLayer[0][
__________________________________________________________________________________________________
level2_res2a_relu2 (Activation) (None, 160, 120, 64) 0           level2_res2a_conv_2_bnScale[0][0]
__________________________________________________________________________________________________
level2_res2a_conv_4_convLayer ( (None, 160, 120, 256 16640       level1_mp[0][0]                  
__________________________________________________________________________________________________
level2_res2a_conv_3_convLayer ( (None, 160, 120, 256 16640       level2_res2a_relu2[0][0]         
__________________________________________________________________________________________________
level2_res2a_conv_4_bnScale (Ba (None, 160, 120, 256 1024        level2_res2a_conv_4_convLayer[0][
__________________________________________________________________________________________________
level2_res2a_conv_3_bnScale (Ba (None, 160, 120, 256 1024        level2_res2a_conv_3_convLayer[0][
__________________________________________________________________________________________________
level2_res2a_add (Add)          (None, 160, 120, 256 0           level2_res2a_conv_4_bnScale[0][0]
                                                                 level2_res2a_conv_3_bnScale[0][0]
__________________________________________________________________________________________________
level2_res2a_relu3 (Activation) (None, 160, 120, 256 0           level2_res2a_add[0][0]           
__________________________________________________________________________________________________
level2_res2b_conv_1_convLayer ( (None, 160, 120, 64) 16448       level2_res2a_relu3[0][0]         
__________________________________________________________________________________________________
level2_res2b_conv_1_bnScale (Ba (None, 160, 120, 64) 256         level2_res2b_conv_1_convLayer[0][
__________________________________________________________________________________________________
level2_res2b_relu1 (Activation) (None, 160, 120, 64) 0           level2_res2b_conv_1_bnScale[0][0]
__________________________________________________________________________________________________
level2_res2b_conv_2_convLayer ( (None, 160, 120, 64) 36928       level2_res2b_relu1[0][0]         
__________________________________________________________________________________________________
level2_res2b_conv_2_bnScale (Ba (None, 160, 120, 64) 256         level2_res2b_conv_2_convLayer[0][
__________________________________________________________________________________________________
level2_res2b_relu2 (Activation) (None, 160, 120, 64) 0           level2_res2b_conv_2_bnScale[0][0]
__________________________________________________________________________________________________
level2_res2b_conv_3_convLayer ( (None, 160, 120, 256 16640       level2_res2b_relu2[0][0]         
__________________________________________________________________________________________________
level2_res2b_conv_3_bnScale (Ba (None, 160, 120, 256 1024        level2_res2b_conv_3_convLayer[0][
__________________________________________________________________________________________________
add_1 (Add)                     (None, 160, 120, 256 0           level2_res2a_relu3[0][0]         
                                                                 level2_res2b_conv_3_bnScale[0][0]
__________________________________________________________________________________________________
level2_res2b_relu3 (Activation) (None, 160, 120, 256 0           add_1[0][0]                      
__________________________________________________________________________________________________
level2_res2c_conv_1_convLayer ( (None, 160, 120, 64) 16448       level2_res2b_relu3[0][0]         
__________________________________________________________________________________________________
level2_res2c_conv_1_bnScale (Ba (None, 160, 120, 64) 256         level2_res2c_conv_1_convLayer[0][
__________________________________________________________________________________________________
level2_res2c_relu1 (Activation) (None, 160, 120, 64) 0           level2_res2c_conv_1_bnScale[0][0]
__________________________________________________________________________________________________
level2_res2c_conv_2_convLayer ( (None, 160, 120, 64) 36928       level2_res2c_relu1[0][0]         
__________________________________________________________________________________________________
level2_res2c_conv_2_bnScale (Ba (None, 160, 120, 64) 256         level2_res2c_conv_2_convLayer[0][
__________________________________________________________________________________________________
level2_res2c_relu2 (Activation) (None, 160, 120, 64) 0           level2_res2c_conv_2_bnScale[0][0]
__________________________________________________________________________________________________
level2_res2c_conv_3_convLayer ( (None, 160, 120, 256 16640       level2_res2c_relu2[0][0]         
__________________________________________________________________________________________________
level2_res2c_conv_3_bnScale (Ba (None, 160, 120, 256 1024        level2_res2c_conv_3_convLayer[0][
__________________________________________________________________________________________________
add_2 (Add)                     (None, 160, 120, 256 0           level2_res2b_relu3[0][0]         
                                                                 level2_res2c_conv_3_bnScale[0][0]
__________________________________________________________________________________________________
level2_res2c_relu3 (Activation) (None, 160, 120, 256 0           add_2[0][0]                      
__________________________________________________________________________________________________
level3_res3a_conv_1_convLayer ( (None, 80, 60, 128)  32896       level2_res2c_relu3[0][0]         
__________________________________________________________________________________________________
level3_res3a_conv_1_bnScale (Ba (None, 80, 60, 128)  512         level3_res3a_conv_1_convLayer[0][
__________________________________________________________________________________________________
level3_res3a_relu1 (Activation) (None, 80, 60, 128)  0           level3_res3a_conv_1_bnScale[0][0]
__________________________________________________________________________________________________
level3_res3a_conv_2_convLayer ( (None, 80, 60, 128)  147584      level3_res3a_relu1[0][0]         
__________________________________________________________________________________________________
level3_res3a_conv_2_bnScale (Ba (None, 80, 60, 128)  512         level3_res3a_conv_2_convLayer[0][
__________________________________________________________________________________________________
level3_res3a_relu2 (Activation) (None, 80, 60, 128)  0           level3_res3a_conv_2_bnScale[0][0]
__________________________________________________________________________________________________
level3_res3a_conv_4_convLayer ( (None, 80, 60, 512)  131584      level2_res2c_relu3[0][0]         
__________________________________________________________________________________________________
level3_res3a_conv_3_convLayer ( (None, 80, 60, 512)  66048       level3_res3a_relu2[0][0]         
__________________________________________________________________________________________________
level3_res3a_conv_4_bnScale (Ba (None, 80, 60, 512)  2048        level3_res3a_conv_4_convLayer[0][
__________________________________________________________________________________________________
level3_res3a_conv_3_bnScale (Ba (None, 80, 60, 512)  2048        level3_res3a_conv_3_convLayer[0][
__________________________________________________________________________________________________
level3_res3a_add (Add)          (None, 80, 60, 512)  0           level3_res3a_conv_4_bnScale[0][0]
                                                                 level3_res3a_conv_3_bnScale[0][0]
__________________________________________________________________________________________________
level3_res3a_relu3 (Activation) (None, 80, 60, 512)  0           level3_res3a_add[0][0]           
__________________________________________________________________________________________________
level3_res3b_conv_1_convLayer ( (None, 80, 60, 128)  65664       level3_res3a_relu3[0][0]         
__________________________________________________________________________________________________
level3_res3b_conv_1_bnScale (Ba (None, 80, 60, 128)  512         level3_res3b_conv_1_convLayer[0][
__________________________________________________________________________________________________
level3_res3b_relu1 (Activation) (None, 80, 60, 128)  0           level3_res3b_conv_1_bnScale[0][0]
__________________________________________________________________________________________________
level3_res3b_conv_2_convLayer ( (None, 80, 60, 128)  147584      level3_res3b_relu1[0][0]         
__________________________________________________________________________________________________
level3_res3b_conv_2_bnScale (Ba (None, 80, 60, 128)  512         level3_res3b_conv_2_convLayer[0][
__________________________________________________________________________________________________
level3_res3b_relu2 (Activation) (None, 80, 60, 128)  0           level3_res3b_conv_2_bnScale[0][0]
__________________________________________________________________________________________________
level3_res3b_conv_3_convLayer ( (None, 80, 60, 512)  66048       level3_res3b_relu2[0][0]         
__________________________________________________________________________________________________
level3_res3b_conv_3_bnScale (Ba (None, 80, 60, 512)  2048        level3_res3b_conv_3_convLayer[0][
__________________________________________________________________________________________________
add_3 (Add)                     (None, 80, 60, 512)  0           level3_res3a_relu3[0][0]         
                                                                 level3_res3b_conv_3_bnScale[0][0]
__________________________________________________________________________________________________
level3_res3b_relu3 (Activation) (None, 80, 60, 512)  0           add_3[0][0]                      
__________________________________________________________________________________________________
level3_res3c_conv_1_convLayer ( (None, 80, 60, 128)  65664       level3_res3b_relu3[0][0]         
__________________________________________________________________________________________________
level3_res3c_conv_1_bnScale (Ba (None, 80, 60, 128)  512         level3_res3c_conv_1_convLayer[0][
__________________________________________________________________________________________________
level3_res3c_relu1 (Activation) (None, 80, 60, 128)  0           level3_res3c_conv_1_bnScale[0][0]
__________________________________________________________________________________________________
level3_res3c_conv_2_convLayer ( (None, 80, 60, 128)  147584      level3_res3c_relu1[0][0]         
__________________________________________________________________________________________________
level3_res3c_conv_2_bnScale (Ba (None, 80, 60, 128)  512         level3_res3c_conv_2_convLayer[0][
__________________________________________________________________________________________________
level3_res3c_relu2 (Activation) (None, 80, 60, 128)  0           level3_res3c_conv_2_bnScale[0][0]
__________________________________________________________________________________________________
level3_res3c_conv_3_convLayer ( (None, 80, 60, 512)  66048       level3_res3c_relu2[0][0]         
__________________________________________________________________________________________________
level3_res3c_conv_3_bnScale (Ba (None, 80, 60, 512)  2048        level3_res3c_conv_3_convLayer[0][
__________________________________________________________________________________________________
add_4 (Add)                     (None, 80, 60, 512)  0           level3_res3b_relu3[0][0]         
                                                                 level3_res3c_conv_3_bnScale[0][0]
__________________________________________________________________________________________________
level3_res3c_relu3 (Activation) (None, 80, 60, 512)  0           add_4[0][0]                      
__________________________________________________________________________________________________
level4_res4a_conv_1_convLayer ( (None, 40, 30, 256)  131328      level3_res3c_relu3[0][0]         
__________________________________________________________________________________________________
level4_res4a_conv_1_bnScale (Ba (None, 40, 30, 256)  1024        level4_res4a_conv_1_convLayer[0][
__________________________________________________________________________________________________
level4_res4a_relu1 (Activation) (None, 40, 30, 256)  0           level4_res4a_conv_1_bnScale[0][0]
__________________________________________________________________________________________________
level4_res4a_conv_2_convLayer ( (None, 40, 30, 256)  590080      level4_res4a_relu1[0][0]         
__________________________________________________________________________________________________
level4_res4a_conv_2_bnScale (Ba (None, 40, 30, 256)  1024        level4_res4a_conv_2_convLayer[0][
__________________________________________________________________________________________________
level4_res4a_relu2 (Activation) (None, 40, 30, 256)  0           level4_res4a_conv_2_bnScale[0][0]
__________________________________________________________________________________________________
level4_res4a_conv_4_convLayer ( (None, 40, 30, 1024) 525312      level3_res3c_relu3[0][0]         
__________________________________________________________________________________________________
level4_res4a_conv_3_convLayer ( (None, 40, 30, 1024) 263168      level4_res4a_relu2[0][0]         
__________________________________________________________________________________________________
level4_res4a_conv_4_bnScale (Ba (None, 40, 30, 1024) 4096        level4_res4a_conv_4_convLayer[0][
__________________________________________________________________________________________________
level4_res4a_conv_3_bnScale (Ba (None, 40, 30, 1024) 4096        level4_res4a_conv_3_convLayer[0][
__________________________________________________________________________________________________
level4_res4a_add (Add)          (None, 40, 30, 1024) 0           level4_res4a_conv_4_bnScale[0][0]
                                                                 level4_res4a_conv_3_bnScale[0][0]
__________________________________________________________________________________________________
level4_res4a_relu3 (Activation) (None, 40, 30, 1024) 0           level4_res4a_add[0][0]           
__________________________________________________________________________________________________
level4_res4b_conv_1_convLayer ( (None, 40, 30, 256)  262400      level4_res4a_relu3[0][0]         
__________________________________________________________________________________________________
level4_res4b_conv_1_bnScale (Ba (None, 40, 30, 256)  1024        level4_res4b_conv_1_convLayer[0][
__________________________________________________________________________________________________
level4_res4b_relu1 (Activation) (None, 40, 30, 256)  0           level4_res4b_conv_1_bnScale[0][0]
__________________________________________________________________________________________________
level4_res4b_conv_2_convLayer ( (None, 40, 30, 256)  590080      level4_res4b_relu1[0][0]         
__________________________________________________________________________________________________
level4_res4b_conv_2_bnScale (Ba (None, 40, 30, 256)  1024        level4_res4b_conv_2_convLayer[0][
__________________________________________________________________________________________________
level4_res4b_relu2 (Activation) (None, 40, 30, 256)  0           level4_res4b_conv_2_bnScale[0][0]
__________________________________________________________________________________________________
level4_res4b_conv_3_convLayer ( (None, 40, 30, 1024) 263168      level4_res4b_relu2[0][0]         
__________________________________________________________________________________________________
level4_res4b_conv_3_bnScale (Ba (None, 40, 30, 1024) 4096        level4_res4b_conv_3_convLayer[0][
__________________________________________________________________________________________________
add_5 (Add)                     (None, 40, 30, 1024) 0           level4_res4a_relu3[0][0]         
                                                                 level4_res4b_conv_3_bnScale[0][0]
__________________________________________________________________________________________________
level4_res4b_relu3 (Activation) (None, 40, 30, 1024) 0           add_5[0][0]                      
__________________________________________________________________________________________________
level4_res4c_conv_1_convLayer ( (None, 40, 30, 256)  262400      level4_res4b_relu3[0][0]         
__________________________________________________________________________________________________
level4_res4c_conv_1_bnScale (Ba (None, 40, 30, 256)  1024        level4_res4c_conv_1_convLayer[0][
__________________________________________________________________________________________________
level4_res4c_relu1 (Activation) (None, 40, 30, 256)  0           level4_res4c_conv_1_bnScale[0][0]
__________________________________________________________________________________________________
level4_res4c_conv_2_convLayer ( (None, 40, 30, 256)  590080      level4_res4c_relu1[0][0]         
__________________________________________________________________________________________________
level4_res4c_conv_2_bnScale (Ba (None, 40, 30, 256)  1024        level4_res4c_conv_2_convLayer[0][
__________________________________________________________________________________________________
level4_res4c_relu2 (Activation) (None, 40, 30, 256)  0           level4_res4c_conv_2_bnScale[0][0]
__________________________________________________________________________________________________
level4_res4c_conv_3_convLayer ( (None, 40, 30, 1024) 263168      level4_res4c_relu2[0][0]         
__________________________________________________________________________________________________
level4_res4c_conv_3_bnScale (Ba (None, 40, 30, 1024) 4096        level4_res4c_conv_3_convLayer[0][
__________________________________________________________________________________________________
add_6 (Add)                     (None, 40, 30, 1024) 0           level4_res4b_relu3[0][0]         
                                                                 level4_res4c_conv_3_bnScale[0][0]
__________________________________________________________________________________________________
level4_res4c_relu3 (Activation) (None, 40, 30, 1024) 0           add_6[0][0]                      
__________________________________________________________________________________________________
level4_res4d_conv_1_convLayer ( (None, 40, 30, 256)  262400      level4_res4c_relu3[0][0]         
__________________________________________________________________________________________________
level4_res4d_conv_1_bnScale (Ba (None, 40, 30, 256)  1024        level4_res4d_conv_1_convLayer[0][
__________________________________________________________________________________________________
level4_res4d_relu1 (Activation) (None, 40, 30, 256)  0           level4_res4d_conv_1_bnScale[0][0]
__________________________________________________________________________________________________
level4_res4d_conv_2_convLayer ( (None, 40, 30, 256)  590080      level4_res4d_relu1[0][0]         
__________________________________________________________________________________________________
level4_res4d_conv_2_bnScale (Ba (None, 40, 30, 256)  1024        level4_res4d_conv_2_convLayer[0][
__________________________________________________________________________________________________
level4_res4d_relu2 (Activation) (None, 40, 30, 256)  0           level4_res4d_conv_2_bnScale[0][0]
__________________________________________________________________________________________________
level4_res4d_conv_3_convLayer ( (None, 40, 30, 1024) 263168      level4_res4d_relu2[0][0]         
__________________________________________________________________________________________________
level4_res4d_conv_3_bnScale (Ba (None, 40, 30, 1024) 4096        level4_res4d_conv_3_convLayer[0][
__________________________________________________________________________________________________
add_7 (Add)                     (None, 40, 30, 1024) 0           level4_res4c_relu3[0][0]         
                                                                 level4_res4d_conv_3_bnScale[0][0]
__________________________________________________________________________________________________
level4_res4d_relu3 (Activation) (None, 40, 30, 1024) 0           add_7[0][0]                      
__________________________________________________________________________________________________
level5_conv4e_1_convLayer (Conv (None, 40, 30, 512)  4719104     level4_res4d_relu3[0][0]         
__________________________________________________________________________________________________
level5_conv4e_1_bnScale (BatchN (None, 40, 30, 512)  2048        level5_conv4e_1_convLayer[0][0]  
__________________________________________________________________________________________________
level5_conv4f_1_convLayer (Conv (None, 40, 30, 256)  1179904     level5_conv4e_1_bnScale[0][0]    
__________________________________________________________________________________________________
level5_conv4f_1_bnScale (BatchN (None, 40, 30, 256)  1024        level5_conv4f_1_convLayer[0][0]  
__________________________________________________________________________________________________
main_loss_conv (Conv2D)         (None, 40, 30, 1)    2305        level5_conv4f_1_bnScale[0][0]    
__________________________________________________________________________________________________
interm_output1_deconv (Conv2DTr (None, 320, 240, 1)  8193        level3_res3a_relu3[0][0]         
__________________________________________________________________________________________________
interm_output2_deconv (Conv2DTr (None, 160, 120, 1)  16385       level4_res4a_relu3[0][0]         
__________________________________________________________________________________________________
interm_output3_deconv (Conv2DTr (None, 160, 120, 1)  8193        level5_conv4e_1_bnScale[0][0]    
__________________________________________________________________________________________________
main_loss_deconv (Conv2DTranspo (None, 40, 30, 1)    10          main_loss_conv[0][0]             
==================================================================================================
Total params: 12,003,534
Trainable params: 11,979,086
Non-trainable params: 24,448
__________________________________________________________________________________________________
